# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\Robot_2013\asservissement\asservissement.cydsn\asservissement.cyprj
# Date: Sun, 13 May 2012 20:25:43 GMT
#set_units -time ns
create_clock -name {ClockBlock/clk_bus} -period 41.666666666666664 -waveform {0 20.8333333333333} [get_pins {ClockBlock/clk_bus}]
create_clock -name {ClockBlock/dclk_0} -period 1083.3333333333333 -waveform {0 541.666666666667} [get_pins {ClockBlock/dclk_0}]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {uart_pc_IntClock} -source [get_pins {ClockBlock/clk_sync}] -divide_by 26 -duty_cycle 50 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -duty_cycle 50 [list [get_pins {ClockBlock/clk_bus_glb}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for D:\Robot_2013\asservissement\asservissement.cydsn\TopDesign\TopDesign.cysch
# Project: D:\Robot_2013\asservissement\asservissement.cydsn\asservissement.cyprj
# Date: Sun, 13 May 2012 20:25:35 GMT
